# SymbolGeometryId Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SymbolGeometryId Members
SymbolGeometryId Class Methods Properties See Also
---
The SymbolGeometryId type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AsUniqueIdentifier | Returns a string suitable to determine if two instances point to the same piece of geometry managed by the same symbol element. |
| Dispose | Releases all resources used by the SymbolGeometryId |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| SymbolId | The id of the symbol that is containing the shared geometry. |

# See Also
SymbolGeometryId Class
Autodesk.Revit.DB Namespace